Repository: marcelocripe/Midnight_Commander_pt_BR
Catalog: mc_hint_*.po
Languages: pt_br

source: Hint: Use C-x t to copy tagged file names to the command line.
pt_br: Dica: Pressione simultaneamente as teclas Ctrl+X, em seguida, pressione a tecla T para copiar o nome dos arquivos marcados para a linha de comando.

source: Hint: Use C-x p to copy the current pathname to the command line.
pt_br: Dica: Pressione simultaneamente as teclas Ctrl+X, em seguida, pressione a tecla P para copiar o nome do caminho atual para a linha de comando.

source: Hint: Completion: use M-Tab (or Esc+Tab). Type it twice to get a list.
pt_br: Dica: Para concluir: Pressione simultaneamente as teclas M+Tab (ou Esc+Tab). Pressione duas vezes para obter uma lista.

source: Hint: Use M-p and M-n to access the command history.
pt_br: Dica: Pressione simultaneamente as teclas M+P e M+N para acessar o histórico de comandos.

source: Hint: Need to quote a character? Use Control-q and the character.
pt_br: Dica: Para inserir um caractere especial, pressione simultaneamente as teclas Crtl+Q e o caractere.

source: Hint: Tired of these messages? Turn them off from the Options/Layout menu.
pt_br: Dica: Para não exibir as mensagens das dicas de ferramentas, desative-as no menu Opções, Leiaute.

source: Hint: Selecting directories: add a slash to the end of the matching pattern.
pt_br: Dica: Selecionando diretórios: Adicione uma barra ao final do padrão correspondente.

source: Hint: If your terminal lacks functions keys, use the ESC+number sequence.
pt_br: Dica: Se o seu terminal não for compatível com as teclas de função, utilize a sequência com ESC+Número.

source: Hint: The homepage of GNU Midnight Commander: http://www.midnight-commander.org/
pt_br: Dica: A página eletrônica do GNU Midnight Commander: http://www.midnight-commander.org/.

source: Hint: Please send any bug reports to mc-devel@gnome.org
pt_br: Dica: Por favor, envie quaisquer relatórios de falhas ou erros para mc-devel@gnome.org.

source: Hint: Tab changes your current panel.
pt_br: Dica: A tecla Tab altera seu painel atual.

source: Hint: VFS coolness: tap enter on a tar file to examine its contents.
pt_br: Dica: Coisas legais do VFS: Pressione a tecla Enter em um arquivo com a extensão .tar para examinar o seu conteúdo.

source: Hint: We also have a nice manual page.
pt_br: Dica: Nós também temos uma ótima página com o manual do Midnight Commander.

source: Hint: Do you want lynx-style navigation? Set it in the Configuration dialog.
pt_br: Dica: Para navegar no estilo do navegador de internet por modo texto Lynx, defina esta opção na caixa de diálogo das Configurações.

source: Hint: % macros work even on the command line.
pt_br: Dica: Os macros % funcionam mesmo na linha de comando.

source: Hint: M-! will allow you to execute programs and see the output in the viewer.
pt_br: Dica: Pressione simultaneamente as teclas M+! para executar os programas aplicativos e exibir a saída no visualizador.

source: Hint: The file listing format can be customized; do "man mc" for details.
pt_br: Dica: O formato da listagem de arquivos pode ser personalizada; execute o comando "man mc" para obter mais informações.

source: Hint: %D/%T expands to the tagged files in the opposite directory.
pt_br: Dica: %D/%T expande para os arquivos marcados no diretório oposto.

source: Hint: Want your plain shell? Press C-o, and get back to MC with C-o again.
pt_br: Dica: Para ter o Shell básico, pressione simultaneamente as teclas Ctrl+O e volte novamente para o Midnight Commander com as teclas Ctrl+O.

source: Hint: Setting the CDPATH variable can save you keystrokes in cd commands.
pt_br: Dica: Ao definir a variável CDPATH, você economizará digitações dos comandos cd.

source: Hint: If you want to see your .* files, say so in the Configuration dialog.
pt_br: Dica: Para exibir os seus arquivos .*, defina esta opção na caixa de diálogo das Configurações.

source: Hint: Want to see your *~ backup files? Set it in the Configuration dialog.
pt_br: Dica: Para exibir os seus arquivos de cópia de segurança (backup) *~, defina esta opção na caixa de diálogo nas Configurações.

source: Hint: Completion works on all input lines in all dialogs. Just press M-Tab.
pt_br: Dica: A conclusão funciona em todas as linhas de entrada em todas as caixas de diálogos, pressione simultaneamente as teclas M+Tab.

source: Hint: On slow terminals the -s flag may help.
pt_br: Dica: Em emuladores de terminais lentos, a opção -s pode ajudar.

source: Hint: Find File: you can work on the files found using the Panelize button.
pt_br: Dica: Encontrar um Arquivo: você pode trabalhar em arquivos encontrados utilizando o botão de Painelização.

source: Hint: Want to do complex searches? Use the External Panelize command.
pt_br: Dica: Para fazer pesquisas complexas, pressione o comando de Painelização Externo.

source: Hint: To change directory halfway through typing a command, use M-c (quick cd).
pt_br: Dica: Para alterar o diretório por meio de um comando, pressione simultaneamente as teclas M+C (equivale ao preenchimento rápido do comando cd).

source: Note: Shell commands will not work when you are on a non-local file system.
pt_br: Observação: Os comandos do Shell não vão funcionar quando você estiver em um sistema de arquivos que não seja local.

source: Hint: Bring text back from the dead with C-y.
pt_br: Dica: Para recuperar o texto de volta, pressione simultaneamente as teclas Ctrl-Y.

source: Hint: Are some of your keys not working? Look at Options/Learn keys.
pt_br: Dica: Se algumas das suas teclas não estão funcionando, verifique no menu Opções, Aprender as Teclas.

source: Hint: To look at the output of a command in the viewer, use M-!
pt_br: Dica: Para exibir a saída de um comando no visualizador, pressione simultaneamente as teclas M-!.

source: Hint: F13 (or Shift-F3) invokes the viewer in raw mode.
pt_br: Dica: Pressione a teclas F13 (ou Shift+F3) para invocar o visualizador no modo bruto.

source: Hint: You may specify the editor for F4 with the shell variable EDITOR.
pt_br: Dica: Para especificar o editor, pressione com a tecla F4 com a variável EDITOR do Shell.

source: Hint: You may specify the external viewer with the shell vars VIEWER or PAGER.
pt_br: Dica: Para especificar o visualizador externo, utilize as variáveis VIEWER ou PAGER do Shell.

source: Hint: You can disable all requests for confirmation in Options/Confirmation.
pt_br: Dica: Para desativar todas as solicitações de confirmação, defina esta opção no menu Opções, Confirmações.

source: Hint: Leap to frequently used directories in a single bound with C-\.
pt_br: Dica: Para pular para os diretórios utilizados com mais frequência, pressione simultaneamente as teclas C+\.

source: Hint: You can do anonymous FTP with mc by typing 'cd ftp://machine.edu'
pt_br: Dica: Para utilizar o FTP anonimamente com o Midnight Commander, insira o endereço 'cd ftp://maquina.edu'.

source: Hint: FTP is built in the Midnight Commander, check the File/FTP link menu.
pt_br: Dica: O FTP está embutido no Midnight Commander, verifique o menu Arquivo, FTP.

source: Hint: M-t changes quickly the listing mode.
pt_br: Dica: Para alterar rapidamente para o modo de listagem, pressione simultaneamente as teclas M+T.

source: Hint: You can specify the username when doing ftps: 'cd ftp://user@machine.edu'
pt_br: Dica: Para especificar o nome de usuário quando for utilizar o ftps: 'cd ftp://user@machine.edu'.

source: Hint: You can browse RPM files by tapping enter on top of an rpm file.
pt_br: Dica: Para acessar os arquivos com a extensão .RPM, pressione a tecla Enter após selecionar um arquivo .rpm.

source: Hint: To mark directories on the select dialog box, append a slash.
pt_br: Dica: Para marcar diretórios na caixa de diálogo selecionada, adicione ao final uma barra.

source: Hint: To use the mouse cut and paste may require holding the shift key
pt_br: Dica: Para utilizar os comandos "recortar" e "colar" com o cursor, pode ser necessário segurar a tecla Shift.

source: Hint: Key frequently visited ftp sites in the hotlist: type C-\.
pt_br: Dica: Para definir a tecla de atalho para os endereços de FTP que são visitados com mais frequência no hotlist, pressione simultaneamente as teclas C+\.
